// (Linear Data Structure)

// লিনিয়ার ডেটা স্ট্রাকচারগুলিতে তথ্যগুলি একের পর এক সংরক্ষিত হয়। এটি একটি সিকোয়েন্স অনুযায়ী সাজানো থাকে, যেখানে একটি উপাদান অন্যটির সাথে সরাসরি যুক্ত থাকে।

// 1. Array

//     একাধিক উপাদান সংরক্ষণের জন্য ব্যবহার করা হয়, যেখানে সব উপাদানের ডেটা একই ধরনের হয়।
//     অ্যারের উপাদানগুলি সূচক (index) দ্বারা অ্যাক্সেস করা হয়।

let arr = [10, 20, 30, 40, 50];
console.log(arr[2]);  //আউটপুট: 30
//---------------------------------------------------------------------------------------------

// 2. List

// ডাইনামিক অ্যারে যা বিভিন্ন ধরনের ডেটা সংরক্ষণ করতে পারে। এটি ইনসার্ট, আপডেট, এবং ডিলিট অপারেশন করতে সক্ষম।

let my_list = [10, "Hello", 3.14, True];
console.log(my_list[1]);  // আউটপুট: Hello
//---------------------------------------------------------------------------------------------

// 3. Stack

//     এটি একটি লিনিয়ার ডেটা স্ট্রাকচার যা প্রথম প্রবেশ এবং প্রথম বাহির হয়।
//     এটি পাইল অথবা লাইফো হিসেবে পরিচিত।
// LIFO (Last In, First Out) পদ্ধতিতে কাজ করে। এটি দুটি প্রধান অপারেশন ব্যবহার করে: Push (যোগ করা) এবং Pop (মুছে ফেলা)।



let stack = [];
stack.push(1);
stack.push(2);
console.log(stack.pop());  // আউটপুট: 2
//---------------------------------------------------------------------------------------------

// 4. Queue

//     এটি একটি লিনিয়ার ডেটা স্ট্রাকচার যা প্রথম প্রবেশ এবং প্রথম বাহির হয়।
//     এটি কিউ হিসেবে পরিচিত।
// FIFO (First In, First Out) পদ্ধতিতে কাজ করে। এতে দুটি প্রধান অপারেশন থাকে: Enqueue (যোগ করা) এবং Dequeue (মুছে ফেলা)।

const queue = [];
queue.push(1);  // Enqueue
queue.push(2);
console.log(queue.shift());  // Dequeue: Output: 1

//---------------------------------------------------------------------------------------------





